Autodesk.Revit.DB.ExportLinetypeTable.GetExportLinetypeTableIteratorInternal
Returns a line type table iterator to the line type table.

Autodesk.Revit.DB.ExportLinetypeTable.GetEnumerator
Returns an enumerator that iterates through the collection.
Returns: An IEnumerator( KeyValuePair(ExportLinetypeKey^,ExportLinetypeInfo^) ) object that can be used to iterate through key-value pairs in the collection.